{
  "backend/main.mo": "Motoko backend defining user profiles, surgery case types, authorization checks, and CRUD operations with per-user case storage.",
  "feature_evidence.json": "Feature evidence report listing implemented features, involved files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of numerous frontend source files.",
  "frontend/DEPLOYMENT_NOTES.md": "Deployment notes detailing a TypeScript build error, its root cause, fixes applied, and step-by-step redeployment instructions.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables, theming rules, and base styles for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main TypeScript entry module.",
  "frontend/src/App.tsx": "Main React application component handling authentication, profile setup, case listing, case form modals, search, and sorting UI.",
  "frontend/src/components/cases/CameraCapture.tsx": "Provides a camera interface to start, stop, switch, retry, and capture photos, returning a data URL on success. Handles cleanup, errors, and loading states.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays key details of a surgery case with edit capability and a tasks checklist. Updates task changes locally and on the server.",
  "frontend/src/components/cases/CaseForm.tsx": "Form for creating or editing surgery cases with demographics, dates, tasks, and optional image capture. Supports prefill, validation, and saving to local and server stores.",
  "frontend/src/components/cases/CaseList.tsx": "Lists surgery cases with filtering, sorting, and empty states. Integrates authentication, backend connection, and online status checks.",
  "frontend/src/components/cases/DateField.tsx": "Combined input and calendar picker for selecting dates in YYYY-MM-DD format. Validates input and syncs with parent state.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Provides a text area and optional camera capture to quickly input demographic data. Manages camera dialog, errors, and image preview/removal.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Displays an empty-state message for cases, with optional migration guidance and dynamic messaging based on auth and connectivity.",
  "frontend/src/components/cases/SortControls.tsx": "Provides UI controls to select a sort field and toggle ascending or descending order.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Renders a normalized tasks checklist with checkboxes and handles task toggle updates.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all stored cases to a CSV file and triggers a download with basic error handling.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "Allows users to upload and parse a CSV, preview warnings/errors, and import cases into the store.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Catches errors inside modal content and shows a recovery UI with logging and reset handling.",
  "frontend/src/components/layout/Footer.tsx": "Displays a footer with attribution, current year, and a referral link.",
  "frontend/src/components/layout/Header.tsx": "Shows the app header with branding and login/logout controls tied to Internet Identity.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Shows a recovery screen for startup errors with guidance and retry/reload actions.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Displays online, backend, and sync status with retry and sync controls using various hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to detect initialization failures, track errors, and provide retry behavior.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines identity, actor state, and connectivity probing to expose unified backend connection status with retry.",
  "frontend/src/hooks/useCasesStore.ts": "Loads, merges, and manages surgery cases across local storage and server with add/update/delete/import mutations.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Derives a Draft or Live environment label based on hostname heuristics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, identity loading, login/logout, and status tracking.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using navigator events.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and surgery cases with authorization-aware error handling.",
  "frontend/src/hooks/useSync.ts": "Implements local-to-server case sync workflow, merging, normalizing, and persisting cases with error handling.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes and base styling.",
  "frontend/src/lib/utils.ts": "Provides a utility function for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/types/cases.ts": "Type definitions for local surgery cases and form data extending backend models.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into user-friendly categories and formats initialization errors.",
  "frontend/src/utils/csv.ts": "CSV import/export utilities for surgery cases with validation, parsing, and task column handling.",
  "frontend/src/utils/dates.ts": "Timezone-safe utilities for converting, validating, and formatting date-only strings and nanoseconds.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and checks the draft admin token from URL parameters or session storage.",
  "frontend/src/utils/localPersistence.ts": "Handles saving, loading, and clearing surgery cases in localStorage with BigInt-safe serialization and normalization.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases, preserving local-only fields, and prepares pending changes for sync.",
  "frontend/src/utils/prefill.ts": "Finds the latest case matching an MRN and extracts demographic prefill data from it.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities for creating, normalizing, updating, and querying task checklists.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and cleaning hash parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes project metadata, known issues, features, and pending requests for the Surgery Case Tracker."
}