{
  "backend/main.mo": "Motoko backend defining user profiles and surgery case types with access control and CRUD operations, storing cases per caller principal.",
  "feature_evidence.json": "Feature evidence report mapping a demographics‑paste bug fix to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files covering hooks, utilities, components, and case‑management logic.",
  "frontend/DEPLOYMENT_NOTES.md": "Documentation describing when and how to redeploy the frontend with fresh backend bindings.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables and base styling for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React frontend via main.tsx.",
  "frontend/redeploy.sh": "Script performing deterministic frontend redeploy with clean rebuild and deployment steps.",
  "frontend/scripts/clean-rebuild-frontend.sh": "Script that wipes old build artifacts, reinstalls dependencies, regenerates backend bindings, and rebuilds the frontend.",
  "frontend/scripts/verify-live-backend-binding.md": "Guide explaining how to verify that the live frontend uses fresh backend bindings and the correct canister ID.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup, case list, case form modals, sorting, and search.",
  "frontend/src/components/cases/CameraCapture.tsx": "Empty file placeholder for a camera capture component.",
  "frontend/src/components/cases/CaseCard.tsx": "Renders a surgery case card with patient details, arrival info, complaint, owner data, and a tasks checklist with local/server sync.",
  "frontend/src/components/cases/CaseForm.tsx": "Form for creating or editing cases with demographics, tasks, prefill logic, and state management for saving.",
  "frontend/src/components/cases/CaseList.tsx": "Displays searchable and sortable case cards with loading, empty states, and migration guidance.",
  "frontend/src/components/cases/DateField.tsx": "Date input component combining a text field and calendar popover with validation.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Textarea that extracts and returns demographics when text is pasted.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Shows empty state messaging and optional migration guidance based on authentication and connectivity.",
  "frontend/src/components/cases/SortControls.tsx": "Controls for selecting sort field and toggling ascending/descending order.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Renders required tasks with checkboxes and handles task toggling after normalization.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports current cases to a downloadable CSV file with success/error toasts.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "UI dialog for uploading a CSV, parsing rows into cases, showing warnings/errors, and importing them via store mutation.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Error boundary for modal content that logs details and shows a fallback alert with a close button.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying app copyright and link attribution with dynamic year and hostname tracking.",
  "frontend/src/components/layout/Header.tsx": "Header with app title, environment badge, and login/logout handling using Internet Identity and query reset.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Recovery screen shown on startup failures, displaying error details and offering retry or reload actions.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Status bar showing online state, backend connection state, and providing retry and sync controls with error toasts.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on identity, auto-initializing access control and invalidating queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Wrapper hook around useActor that tracks initialization failures, exposes errors, and provides retry logic.",
  "frontend/src/hooks/useBackendConnection.ts": "Manages backend connectivity by combining identity, actor init, and a probe query, exposing connection state and a retry function.",
  "frontend/src/hooks/useCasesStore.ts": "Merges local and server surgery cases and provides mutations for adding, updating, deleting, and importing cases with local persistence.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Determines whether the app is in Draft or Live mode based on URL hostname.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading and managing identity state, login flow, and logout behavior.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for profiles and surgery cases with authorization-aware error handling.",
  "frontend/src/hooks/useSync.ts": "Synchronizes local cases with the server, handling pending changes, merging results, and updating local and query state.",
  "frontend/src/index.css": "TailwindCSS base styles and theme variables for light and dark mode.",
  "frontend/src/lib/utils.ts": "Utility function to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/types/cases.ts": "Defines extended surgery case and form data types for local use, adding fields like localId, pendingSync, and raw demographics text.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into categories and provides user-friendly messages, with helpers for actor initialization failures.",
  "frontend/src/utils/csv.ts": "Converts surgery cases to CSV and parses CSV files into structured rows with validation, warnings, and error reporting.",
  "frontend/src/utils/dates.ts": "Provides timezone-safe utilities for validating, formatting, and converting date-only strings and nanosecond timestamps.",
  "frontend/src/utils/demographicsExtract.ts": "Extracts patient demographics from pasted text using regex-based pattern matching to infer fields like MRN, name, and species.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and checks the Draft admin token from URL or sessionStorage.",
  "frontend/src/utils/localPersistence.ts": "Loads, normalizes, saves, and clears locally stored surgery cases with BigInt-safe JSON handling.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases, preserving local-only fields, and prepares cases for sync by combining pending local changes with server data.",
  "frontend/src/utils/prefill.ts": "Provides helpers to find the latest case by MRN and extract patient demographic fields for prefill.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities to create, normalize, and derive required/checked task checklists.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-stored parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, plugins, and container settings.",
  "project_state.json": "Stores project metadata, issues, and a fix request related to Quick Add demographics paste flow."
}