{
  "backend/main.mo": "Defines the backend actor for managing user profiles and surgery cases with access control, case creation, retrieval, and update logic.",
  "backend/migration.mo": "Provides a migration function converting old list‑based case storage into a map keyed by caseId.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/DEPLOYMENT_NOTES.md": "Deployment guidance describing when and how to redeploy the frontend with fresh backend bindings.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "Base HTML entry point loading the frontend application via main.tsx.",
  "frontend/redeploy.sh": "Script performing deterministic full redeploy of the frontend, including rebuild and deployment steps.",
  "frontend/scripts/clean-rebuild-frontend.sh": "Script that removes stale artifacts, reinstalls dependencies, regenerates backend bindings, and builds the frontend.",
  "frontend/scripts/verify-live-backend-binding.md": "Guide for verifying that the deployed frontend uses the correct and current backend canister bindings.",
  "frontend/src/App.tsx": "Main React application component handling authentication, backend connection, profile setup, case management UI, and modal flows.",
  "frontend/src/components/cases/CameraCapture.tsx": "Empty placeholder file for a camera capture component.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case card with patient info, task toggling, edit and delete actions, and date formatting. Handles mutation calls to update or delete a case with UI feedback.",
  "frontend/src/components/cases/CaseForm.tsx": "Provides a full form for creating or editing surgery cases with prefill logic, demographics extraction, validation, and task checklist handling. Manages form state, initialization, and save operations.",
  "frontend/src/components/cases/CaseList.tsx": "Renders and manages the searchable, sortable list of cases with loading, error, and empty-state handling. Filters and sorts cases before displaying CaseCard components.",
  "frontend/src/components/cases/DateField.tsx": "Reusable date input with a text field and calendar popover, converting and validating date strings. Syncs internal state with external value changes.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Provides a paste-only textarea that extracts and returns demographic data from pasted text. Clears itself after processing extracted demographics.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Displays empty-state messaging and optional migration guidance depending on authentication and backend connectivity. Shows instructions for importing or migrating case data.",
  "frontend/src/components/cases/ServerCasesLoadError.tsx": "Shows a descriptive error alert when server case loading fails and offers a retry button. Uses backend error classification to provide clearer messaging.",
  "frontend/src/components/cases/SortControls.tsx": "UI controls for selecting sort field and toggling ascending/descending order. Updates parent-controlled sort settings through callbacks.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Renders a filtered list of required, incomplete tasks with optional color-coded borders and toggles task completion.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all stored cases to a downloadable CSV file and shows toast notifications for success or errors.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "Provides a dialog to upload, parse, validate, and import cases from a CSV file with error handling and progress feedback.",
  "frontend/src/components/errors/BackendConnectionTroubleshooting.tsx": "Displays a troubleshooting alert for backend connection failures with guidance and retry options.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Error boundary for modal content that logs errors and shows a recovery UI allowing the modal to be closed.",
  "frontend/src/components/layout/Footer.tsx": "Renders the app footer with branding, current year, and a caffeine.ai referral link.",
  "frontend/src/components/layout/Header.tsx": "Displays the app header with branding and login/logout handling via Internet Identity, including environment badges.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Shows a recovery screen for startup connection issues with tailored messaging for token errors and retry/reload controls.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "UI bar showing online status, backend connection state, and sync controls with toast feedback.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on identity, recreating and invalidating queries when identity changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor with error detection and retry logic to surface initialization failures.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines identity, actor state, and backend probing to determine connection status and provide retry handling.",
  "frontend/src/hooks/useCasesStore.ts": "Manages merged local and server case data, with mutations that persist to local storage and update queries.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Returns 'Draft' or 'Live' based on hostname heuristics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading and managing identity state and login lifecycle.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status via window events and navigator.onLine.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and surgery cases, including a paginated case fetcher and creation mutation with authorization handling.",
  "frontend/src/hooks/useSync.ts": "Implements a sync routine that merges local and server surgery cases using pagination, resolves conflicts, normalizes data, and updates local storage and React Query state.",
  "frontend/src/index.css": "Configures Tailwind base layers and CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the main App component.",
  "frontend/src/types/cases.ts": "Defines local surgery case types with sync-related fields and form data structures based on backend case types.",
  "frontend/src/utils/backendErrorMessages.ts": "Provides helpers to classify backend errors into categories with user-friendly messages, including actor initialization error handling.",
  "frontend/src/utils/csv.ts": "Implements CSV export and parsing for surgery cases, including validation, task column handling, and robust line parsing.",
  "frontend/src/utils/dates.ts": "Contains timezone-safe date-only utilities for validation and conversion, plus legacy date helpers for broader formatting and parsing.",
  "frontend/src/utils/demographicsExtract.ts": "Parses pasted text with regex to extract patient demographics and returns a best‑effort structured object.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and checks a persisted Draft admin token from the URL or sessionStorage.",
  "frontend/src/utils/localPersistence.ts": "Loads, saves, and clears locally persisted surgery cases in localStorage with bigint handling and field normalization.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases while preserving local‑only fields and prepares pending changes for sync.",
  "frontend/src/utils/prefill.ts": "Finds the most recent case by MRN and derives prefill demographic fields from it.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities to create, normalize, and filter task checklists for cases.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes project state and pending backend fixes related to safe loading and syncing of large surgery‑case datasets."
}