{
  "backend/main.mo": "Motoko backend actor defining user profiles, surgery case types, access control, and CRUD operations with per-user case storage and sync timestamps.",
  "feature_evidence.json": "Feature evidence report mapping features to associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "List of frontend file paths with human-written summaries describing their purpose and functionality.",
  "frontend/DEPLOYMENT_NOTES.md": "Markdown instructions for when and how to redeploy the frontend with fresh backend bindings.",
  "frontend/index.css": "Tailwind CSS configuration with light/dark theme CSS variables and base styling.",
  "frontend/index.html": "HTML entrypoint loading the React app and its main TypeScript module.",
  "frontend/redeploy.sh": "Shell script performing deterministic clean rebuild plus frontend deployment with network detection and verification steps.",
  "frontend/scripts/clean-rebuild-frontend.sh": "Script that performs deterministic frontend rebuild, regenerates backend TypeScript bindings, checks for legacy methods, and builds the app.",
  "frontend/scripts/verify-live-backend-binding.md": "Guide for verifying that the deployed frontend uses up‑to‑date backend bindings and correct canister IDs.",
  "frontend/src/App.tsx": "Main app component handling authentication, backend connection, profile setup, case creation/editing, and global layout. Manages modals, sorting, search, and conditional UI states.",
  "frontend/src/components/cases/CameraCapture.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case summary with edit, task toggling, and delete actions. Handles task updates and deletion via mutations and shows confirmation dialogs.",
  "frontend/src/components/cases/CaseForm.tsx": "Form for creating or editing a surgery case with prefilling, validation, demographics parsing, and task checklist setup. Manages form state, initialization, and save/update logic.",
  "frontend/src/components/cases/CaseList.tsx": "Fetches and displays a sortable, searchable list of cases with loading and error states. Filters, sorts, and renders CaseCards or empty-state guidance.",
  "frontend/src/components/cases/DateField.tsx": "Date input component combining a native date field with a popover calendar. Validates, parses, and syncs date-only string values.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Textarea that extracts demographics from pasted text and passes parsed data to a callback. Clears itself after processing input.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Renders guidance when no cases exist, including migration instructions based on environment and connection status. Shows different messages depending on authentication and connectivity.",
  "frontend/src/components/cases/ServerCasesLoadError.tsx": "Displays a destructive alert when server case loading fails and provides a retry button.",
  "frontend/src/components/cases/SortControls.tsx": "Provides UI controls to select sort field and toggle sort direction for cases.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Shows required, incomplete tasks for a case with checkboxes and optional task highlighting.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all cases to a CSV file and shows success or error toasts.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "Handles CSV file upload, parsing, validation, and importing cases into the store.",
  "frontend/src/components/errors/BackendConnectionTroubleshooting.tsx": "Displays a troubleshooting banner for backend connection failures with retry and documentation links.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Error boundary for modals that logs errors and shows a fallback alert with a close button.",
  "frontend/src/components/layout/Footer.tsx": "Renders the app footer with branding and a link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Shows app header with login/logout handling, environment label, and clearing of local data on logout.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Displays a recovery screen for startup connection errors with guidance and retry/reload actions.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "UI bar showing online status, backend connection state, and a sync button with error handling and toasts.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor with error tracking and retry logic, surfacing initialization failures to the UI.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines identity and actor state to determine backend connectivity via ping probes and exposes retry functionality.",
  "frontend/src/hooks/useCasesStore.ts": "Manages local and server surgery cases, merging them and supporting add/update operations with local persistence.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Derives an environment label (Draft or Live) from the current hostname.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identities, and status flags.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status via navigator and window events.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and surgery cases, including paginated case retrieval and case creation.",
  "frontend/src/hooks/useSync.ts": "Implements local-to-server case synchronization with normalization, pagination-based fetching, merging, and error handling.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and theme variables for light and dark modes with global base styling.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity, global styles, and renders the App component.",
  "frontend/src/types/cases.ts": "Declares local surgery case types and form data structures extending backend models.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into categories and generates user-friendly error messages.",
  "frontend/src/utils/csv.ts": "Handles CSV export and import for surgery cases, including parsing, validation, and task column processing.",
  "frontend/src/utils/dates.ts": "Provides timezone-safe utilities for validating, converting, and formatting date-only strings and legacy date helpers.",
  "frontend/src/utils/demographicsExtract.ts": "Extracts patient demographics from pasted text using regex patterns and heuristics.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and checks a persisted Draft admin token from URL or sessionStorage.",
  "frontend/src/utils/localPersistence.ts": "Loads, saves, and clears locally stored surgery cases with BigInt handling and field normalization.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases and prepares pending local changes for sync.",
  "frontend/src/utils/prefill.ts": "Finds the latest case by MRN and extracts demographic prefill data for new entries.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities to create, normalize, and filter surgery task checklists.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, new feature requests, and known issues for the Surgery Case Tracker. Highlights frontend rebuild and redeploy tasks plus backend-binding verification needs."
}