{
  "backend/main.mo": "Motoko backend actor managing user profiles and surgery cases with access control, task checklists, and case comparison utilities.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing recent changes and functionality.",
  "frontend/index.css": "Tailwind CSS base setup defining light and dark theme variables and global styles.",
  "frontend/index.html": "HTML entry point providing the root element and loading the main frontend script.",
  "frontend/src/App.tsx": "Main React app handling authentication, backend connection, profile setup, case list, case form modal, and startup recovery logic.",
  "frontend/src/components/cases/CameraCapture.tsx": "Camera capture component using a custom hook to manage camera state, errors, and photo capture UI.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case card with demographics, arrival info, and a tasks checklist, and syncs task updates locally and to the server.",
  "frontend/src/components/cases/CaseForm.tsx": "Provides a form for creating or editing cases with auto-prefill, validation, and save/update logic.",
  "frontend/src/components/cases/CaseList.tsx": "Renders a sortable list of case cards and shows loading or empty-state UI based on store status.",
  "frontend/src/components/cases/DateField.tsx": "A controlled date input with a popover calendar for selecting and validating YYYY-MM-DD strings.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Textarea input for pasting demographics plus an optional camera dialog for capturing reference images.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Displays an empty-state message and optionally guides users through migrating cases between environments.",
  "frontend/src/components/cases/SortControls.tsx": "UI controls for selecting sort field and toggling sort direction.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Renders required tasks with checkboxes and notifies when task states change.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all cases to a CSV file and handles success or error notifications.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "UI dialog for uploading and parsing a CSV file, showing warnings/errors and importing parsed cases.",
  "frontend/src/components/layout/Footer.tsx": "Renders app footer with branding, year, and link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Displays app header with branding, environment label, and login/logout handling.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Error screen shown on startup connection failures with retry and reload options.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Status bar showing online state, backend connection state, and providing sync and retry controls.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, auto-refetching dependent queries.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to track initialization errors, detect missing tokens, and provide retry logic.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines identity, actor state, and backend probe to determine connection status with retry support.",
  "frontend/src/hooks/useCasesStore.ts": "Manages local and server-synced surgery cases using React Query, including normalization, merging, adding, and updating cases with offline support.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Determines whether the app is running in Draft or Live mode based on hostname heuristics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks and returns the browser’s online/offline status using window events.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for fetching and mutating user profiles and surgery cases with error handling.",
  "frontend/src/hooks/useSync.ts": "Synchronizes locally edited surgery cases with the backend, merging results and updating local storage and React Query state.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/cases.ts": "Defines types for local surgery cases and case form data extending backend models.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into user-friendly categories and provides helpers for common initialization errors.",
  "frontend/src/utils/csv.ts": "Handles CSV export/import for surgery cases, generating rows from cases and parsing CSV text with validation and task column support.",
  "frontend/src/utils/dates.ts": "Provides timezone-safe utilities for validating, converting, and formatting YYYY-MM-DD date strings and nanosecond timestamps.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and checks a persisted admin token from URL or sessionStorage.",
  "frontend/src/utils/localPersistence.ts": "Manages saving, loading, and clearing surgery cases and sync timestamps in localStorage with demographic normalization.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases while preserving local-only fields and prepares cases for syncing by applying pending changes.",
  "frontend/src/utils/prefill.ts": "Finds the latest case by MRN and extracts demographic fields for form prefilling.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities to create, normalize, update, and map task checklists including CSV column mappings.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata containing app summary, architectural notes, known issues, and lists of implemented features for a veterinary surgery case tracker."
}