{
  "backend/main.mo": "Main canister logic defining user profiles, expanded 7‑task surgery case model, access‑controlled CRUD operations, and migration integration.",
  "backend/migration.mo": "Transforms old two‑task case data into the new seven‑task structure with default values while preserving other fields.",
  "feature_evidence.json": "Feature evidence report mapping expanded tasks, UI changes, and CSV updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file including hooks, components, and utilities.",
  "frontend/index.css": "Tailwind base and theme variables defining light and dark mode color tokens and global styles.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top-level React app managing auth, profile setup, case UI, sorting, CSV actions, and overall layout.",
  "frontend/src/components/cases/CameraCapture.tsx": "Provides a camera interface for starting, stopping, switching cameras, and capturing photos using a custom hook.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case card with demographics, date, tasks checklist, and edit handling with local/server sync.",
  "frontend/src/components/cases/CaseForm.tsx": "Form for creating or editing surgery cases with prefill logic, task configuration, and save/update operations.",
  "frontend/src/components/cases/CaseList.tsx": "Renders a sortable list of case cards with loading and empty states.",
  "frontend/src/components/cases/DateField.tsx": "Date input component combining manual entry with a popover calendar selector.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Allows quick entry of demographics text and optional camera capture via a dialog.",
  "frontend/src/components/cases/SortControls.tsx": "Controls for selecting sort field and toggling sort direction.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Displays and updates a list of required tasks with checkboxes.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all stored cases to a CSV file and handles success/error feedback.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "UI dialog for uploading and parsing a CSV file, showing warnings/errors and importing parsed cases into the store.",
  "frontend/src/components/layout/Footer.tsx": "Renders footer with current year, branding, and link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Displays app header and handles login/logout via Internet Identity with loading states.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Shows online/offline status and triggers sync with progress and error feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor tied to Internet Identity and refreshes related queries when identity changes.",
  "frontend/src/hooks/useCasesStore.ts": "React-query store for loading, adding, updating, and importing surgery cases with local persistence and normalization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, state, and AuthClient setup.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status via event listeners.",
  "frontend/src/hooks/useQueries.ts": "React-query hooks wrapping backend operations for user profiles and surgery cases.",
  "frontend/src/hooks/useSync.ts": "Handles syncing local pending case changes to the backend and refreshing local storage and query cache.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and applies base styles.",
  "frontend/src/lib/utils.ts": "Provides a cn() helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/types/cases.ts": "Defines LocalSurgeryCase and CaseFormData types extending backend case structures.",
  "frontend/src/utils/csv.ts": "Handles CSV export/import for surgery cases, including validation, parsing, and task column mapping.",
  "frontend/src/utils/dates.ts": "Utility functions for formatting, parsing, and converting dates to and from nanoseconds.",
  "frontend/src/utils/localPersistence.ts": "Provides localStorage persistence for cases and last sync timestamps with error handling.",
  "frontend/src/utils/prefill.ts": "Finds the latest matching case by MRN and generates prefill form values from it.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities for creating, normalizing, and updating task checklists.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL/session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, animations, plugins, and dark mode support.",
  "project_state.json": "Stores project metadata including summary, architectural notes, known issues, and a list of defined features with their requirements and versions. Used to track app capabilities, problems, and state versioning."
}