{
  "backend/main.mo": "Motoko backend actor managing user profiles and per-user surgery cases with access control, type definitions, case creation, and update scaffolding.",
  "feature_evidence.json": "Feature evidence report listing files, components, and tests supporting clean rebuild and redeploy workflows.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to concise summaries describing their functionality.",
  "frontend/DEPLOYMENT_NOTES.md": "Documentation explaining when and how to perform a clean frontend rebuild to refresh backend bindings.",
  "frontend/index.css": "Tailwind-based stylesheet defining theme variables for light and dark modes and global element styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript bundle.",
  "frontend/scripts/clean-rebuild-frontend.sh": "Shell script performing a deterministic clean rebuild of the frontend including dependency install, backend binding regeneration, and fresh build.",
  "frontend/scripts/verify-live-backend-binding.md": "Guide describing how to verify that the deployed frontend uses fresh backend bindings and the correct canister ID.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup, case list management, search, sorting, and modal-based case editing.",
  "frontend/src/components/cases/CameraCapture.tsx": "Camera UI component enabling photo capture, camera switching, and safe cleanup with data URL output for storage.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case card with demographics, arrival date, complaint, and editable task checklist, syncing updates locally and to the server.",
  "frontend/src/components/cases/CaseForm.tsx": "Form for creating or editing cases with prefill logic, demographics input, validation, and task checklist setup.",
  "frontend/src/components/cases/CaseList.tsx": "Fetches, filters, sorts, and displays cases using CaseCard, showing loading, empty, or search‑no‑results states as needed.",
  "frontend/src/components/cases/DateField.tsx": "Reusable date input with manual entry and calendar popover, validating and formatting date strings.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Allows quick demographics entry with optional camera capture, handling image storage, errors, and preview.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Shows empty-state guidance, including migration instructions depending on authentication and connection state.",
  "frontend/src/components/cases/SortControls.tsx": "Provides UI controls for selecting sort field and toggling sort direction for the case list.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Renders a checklist of required tasks, normalizing input and toggling task states via callbacks.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all cases to a CSV file and downloads it, showing success or error toasts.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "Handles CSV file upload, parsing, validation, and importing cases with user feedback and error handling.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Error boundary for modal content that logs details and shows a fallback UI with a close button.",
  "frontend/src/components/layout/Footer.tsx": "Displays footer with current year, branding, and a caffeine.ai referral link.",
  "frontend/src/components/layout/Header.tsx": "Shows app header with authentication controls, environment label, and identity-based login/logout logic.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Displays a recovery screen for startup connection errors with retry and reload options and contextual guidance.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Shows online status, backend connection state, and sync actions with appropriate error handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, initializing access control and invalidating dependent queries.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor with error tracking and retry logic to detect failed actor initialization.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines identity, actor, and a backend probe to report connection status and provide a full retry flow.",
  "frontend/src/hooks/useCasesStore.ts": "Merges local and server surgery cases and provides mutations for adding, updating, deleting, and importing cases.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Determines environment label (Draft or Live) based on hostname heuristics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and surgery cases via the backend actor.",
  "frontend/src/hooks/useSync.ts": "Synchronizes pending local surgery case changes with the backend and refreshes merged state.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes and applies global base styles.",
  "frontend/src/lib/utils.ts": "Provides a cn helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and InternetIdentityProvider and loads global styles.",
  "frontend/src/types/cases.ts": "Defines LocalSurgeryCase and CaseFormData types extending backend models and re-exports task-related types.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into categories and generates user-friendly error messages.",
  "frontend/src/utils/csv.ts": "Converts surgery cases to CSV and parses CSV files with validation, warnings, and custom line parsing.",
  "frontend/src/utils/dates.ts": "Provides timezone-safe date-only parsing, formatting, and conversion utilities including nanosecond conversions.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and validates a draft admin token from URL or sessionStorage.",
  "frontend/src/utils/localPersistence.ts": "Handles saving, loading, and clearing surgery cases in localStorage with BigInt-safe serialization.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server cases while preserving local-only fields and prepares cases for sync.",
  "frontend/src/utils/prefill.ts": "Finds the latest case matching an MRN and extracts demographic prefill data.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities for creating, normalizing, and updating a 7‑item tasks checklist.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, animations, and plugins for the frontend build.",
  "project_state.json": "Stores project metadata, known issues, and feature requests for the Surgery Case Tracker."
}