{
  "backend/main.mo": "Motoko backend defining surgery case types, access-controlled profile and case CRUD operations, and timestamp-based sorting utilities.",
  "feature_evidence.json": "Feature evidence report listing frontend files, components, and test IDs associated with sync and error‑handling improvements.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend source files covering hooks, components, utilities, and data handling behavior.",
  "frontend/DEPLOYMENT_NOTES.md": "Deployment guide explaining when and how to redeploy the frontend with fresh backend bindings.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling rules.",
  "frontend/index.html": "Base HTML entry point loading the frontend root and main TypeScript module.",
  "frontend/redeploy.sh": "Script performing deterministic clean rebuild and deployment of the frontend with deployment summary output.",
  "frontend/scripts/clean-rebuild-frontend.sh": "Script that wipes cached artifacts, installs deps, ensures backend deployment, regenerates bindings, and rebuilds the frontend.",
  "frontend/scripts/verify-live-backend-binding.md": "Guide for verifying that the live frontend uses fresh backend bindings and correct canister IDs.",
  "frontend/src/App.tsx": "Main React app handling authentication, backend connection, profile setup, case list and form modals, sorting, and sync UI.",
  "frontend/src/components/cases/CameraCapture.tsx": "Placeholder file for a camera capture component with no implemented content.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case card with patient details, task toggling, edit and delete actions, and confirmation dialogs.",
  "frontend/src/components/cases/CaseForm.tsx": "Form component for creating or editing surgery cases with prefill logic, validation, and submission handling.",
  "frontend/src/components/cases/CaseList.tsx": "Lists surgery cases with filtering, sorting, loading states, and integration with authentication and connectivity.",
  "frontend/src/components/cases/DateField.tsx": "A controlled date picker combining a date input and popover calendar with validation.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Textarea that extracts and returns demographics from pasted text for quick form population.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Shows empty-state messaging and optional migration guidance depending on authentication and connectivity.",
  "frontend/src/components/cases/SortControls.tsx": "UI controls to select sort field and toggle ascending/descending order.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Renders required, incomplete tasks with checkboxes and highlights specific task types.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Provides a button that converts stored cases to CSV and triggers a file download.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "Modal dialog for uploading a CSV, parsing rows into cases, and importing them into the store.",
  "frontend/src/components/errors/BackendConnectionTroubleshooting.tsx": "Displays a troubleshooting banner with retry and documentation links when backend connection fails.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Error boundary for modal content that logs errors and offers a close action on failure.",
  "frontend/src/components/layout/Footer.tsx": "Renders application footer with current year and a referral link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Header showing app title and login/logout handling with identity and environment badge.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Recovery screen shown on startup connection errors with retry, reload, and token-specific guidance.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Displays online, backend connection, and sync status with actions to sync or retry backend connection.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, initializing access control and invalidating dependent queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to track initialization errors, provide retry logic, and expose actor, loading, and error states.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines identity and actor state to determine backend connectivity, probes a ping endpoint, and offers full retry handling.",
  "frontend/src/hooks/useCasesStore.ts": "Manages merged local and server surgery cases with React Query, supporting add and update operations synced to local storage.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Derives a simple Draft or Live environment label based on the current hostname.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login flow, state management, and identity persistence.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using navigator events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on user profiles and surgery cases through the backend actor.",
  "frontend/src/hooks/useSync.ts": "Handles syncing local surgery cases with the backend, including pagination fetches, conflict merging, and state updates.",
  "frontend/src/index.css": "Sets Tailwind layers and defines CSS variables for light and dark themes, applying base border and body color utilities.",
  "frontend/src/lib/utils.ts": "Provides a `cn` helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/types/cases.ts": "Defines surgery case-related TypeScript types including local case extensions and form data structures.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into categories and generates user-friendly messages, including actor initialization helpers.",
  "frontend/src/utils/csv.ts": "Implements CSV export and parsing for surgery cases with validation, error tracking, and task column handling.",
  "frontend/src/utils/dates.ts": "Provides timezone-safe utilities for validating, converting, and formatting date-only strings and nanosecond values.",
  "frontend/src/utils/demographicsExtract.ts": "Extracts patient demographics from text using regex-based deterministic parsing with fallbacks.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and validates a persisted draft admin token from URL parameters or sessionStorage.",
  "frontend/src/utils/localPersistence.ts": "Loads, saves, and clears locally persisted surgery cases in localStorage with bigint handling and normalization.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases, preserving local-only fields and preparing combined data for sync operations.",
  "frontend/src/utils/prefill.ts": "Finds the latest case for a given MRN and extracts demographic data for prefill.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task checklist structure and utilities to create, normalize, or derive required tasks for surgery cases.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, layout, animations, and loading plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing schema, known issues, existing features, and pending feature requests for the Surgery Case Tracker."
}