{
  "backend/main.mo": "Motoko actor managing user profiles and per-user surgery cases with access control, creation, retrieval, and update logic plus data type definitions.",
  "feature_evidence.json": "Feature evidence report mapping feature requests to affected frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including hooks, components, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme CSS variables and applying base styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app coordinating authentication, backend connection, profile setup, case management UI, and sync tools.",
  "frontend/src/components/cases/CameraCapture.tsx": "Camera capture component using a custom hook to start, stop, and capture photos with error handling and UI controls.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case card with patient demographics, arrival info, tasks checklist, and edit handling with local/server sync.",
  "frontend/src/components/cases/CaseForm.tsx": "Form for creating or editing a surgery case, supporting prefill logic, demographic entry, and task configuration.",
  "frontend/src/components/cases/CaseList.tsx": "Shows a sortable list of case cards, with loading and empty states.",
  "frontend/src/components/cases/DateField.tsx": "Reusable date input with manual entry and popup calendar selection.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Textarea for quick demographics input with optional camera capture dialog.",
  "frontend/src/components/cases/SortControls.tsx": "Sort field selector and toggle button for ascending/descending sort order.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Renders required tasks with checkboxes and notifies parent on toggle.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all cases to a CSV file and triggers a download.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "Dialog for uploading a CSV, previewing parse results, and importing cases.",
  "frontend/src/components/layout/Footer.tsx": "Displays footer with dynamic year and caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Renders the app header and handles login/logout using Internet Identity, clearing local data and queries on logout.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Displays online, backend, and sync status with retry and sync actions, showing relevant errors for authenticated users.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, reinitializing and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useBackendConnection.ts": "Probes backend connectivity using the actor and provides connection status, errors, and a retry mechanism.",
  "frontend/src/hooks/useCasesStore.ts": "Manages local and server surgery cases with merging, normalization, and mutations for adding and updating cases.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity state and login/logout flow via Internet Identity, exposing status flags through a React context.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using event listeners and returns a boolean value.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles and surgery cases via the backend actor with authorization handling.",
  "frontend/src/hooks/useSync.ts": "Provides a sync function that merges local and server surgery cases, normalizes data, updates storage, and handles errors.",
  "frontend/src/index.css": "Tailwind base styles defining light and dark theme CSS variables and applying global defaults.",
  "frontend/src/lib/utils.ts": "Utility function to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/types/cases.ts": "Type definitions for local surgery cases and form data, extending backend types with local-only fields.",
  "frontend/src/utils/csv.ts": "CSV utilities for exporting cases to CSV and parsing CSV input with validation and warnings.",
  "frontend/src/utils/dates.ts": "Date-only utilities for validation, formatting, and conversion to and from nanoseconds without timezone issues.",
  "frontend/src/utils/localPersistence.ts": "LocalStorage helpers for saving, loading, normalizing, and clearing locally stored surgery cases and sync timestamps.",
  "frontend/src/utils/mergeCases.ts": "Functions to merge local and server surgery cases and prepare pending local changes for backend sync.",
  "frontend/src/utils/prefill.ts": "Provides MRN-based lookup for the latest matching case and extracts demographic fields for prefill.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities to create, normalize, query, and update a 7‑item tasks checklist.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, persisting, and clearing URL and session parameters for routing and state.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for styling the frontend.",
  "project_state.json": "Describes project version, features, issues, and architectural notes for the veterinary surgery case app."
}