{
  "backend/main.mo": "Motoko backend defining user profiles and surgery case types with access control and CRUD-style methods for profiles and surgery cases.",
  "feature_evidence.json": "Feature evidence listing implemented frontend changes, affected files, components, and related test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of key frontend source files.",
  "frontend/DEPLOYMENT_NOTES.md": "Instructions for when and how to redeploy the frontend with correct backend bindings.",
  "frontend/index.css": "Tailwind-based global styles defining light/dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point loading the React frontend via main.tsx.",
  "frontend/redeploy.sh": "Script performing deterministic redeploy of the frontend including rebuild and deployment steps.",
  "frontend/scripts/clean-rebuild-frontend.sh": "Script that performs a clean rebuild of the frontend and regenerates backend bindings.",
  "frontend/scripts/verify-live-backend-binding.md": "Guide for verifying that the deployed frontend uses fresh backend bindings and the correct canister ID.",
  "frontend/src/App.tsx": "Main React app handling authentication, connection state, profile setup, case list UI, and modal workflows.",
  "frontend/src/components/cases/CameraCapture.tsx": "Empty file placeholder for camera capture component (content truncated or not provided).",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case card with patient info, task toggling, edit, and delete actions using store mutations and dialogs.",
  "frontend/src/components/cases/CaseForm.tsx": "Provides a form to create or edit cases with prefill logic, demographic extraction, and task checklist management.",
  "frontend/src/components/cases/CaseList.tsx": "Lists cases with search, sorting, loading states, server error handling, and renders CaseCard items.",
  "frontend/src/components/cases/DateField.tsx": "Renders a date input with a popover calendar and validation syncing typed and selected dates.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Extracts demographics from pasted text and triggers a callback to autofill form fields.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Shows empty-state messaging with optional migration guidance depending on auth and connection state.",
  "frontend/src/components/cases/ServerCasesLoadError.tsx": "Displays a destructive alert for server-load failures with classified messaging and retry option.",
  "frontend/src/components/cases/SortControls.tsx": "Provides controls to choose sort field and toggle sort direction for case lists.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Shows only required, incomplete tasks with optional colored borders and lets users toggle task completion.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports stored cases to a CSV file and triggers a download, with error handling and toasts.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "Imports cases from a CSV file, parses rows into case objects, and adds them to the store with validation and progress UI.",
  "frontend/src/components/errors/BackendConnectionTroubleshooting.tsx": "Displays a prominent error banner with troubleshooting steps and actions when backend communication fails.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Error boundary for modal content that logs errors and shows a recovery UI with a close button.",
  "frontend/src/components/layout/Footer.tsx": "Renders the app footer with branding, the current year, and a link to caffeine.ai.",
  "frontend/src/components/layout/Header.tsx": "Header showing app title and authentication controls, handling login/logout and environment labeling.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Startup error screen explaining connection issues, including special guidance for token-related errors, with retry and reload actions.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "UI bar showing online status, backend connection, and sync controls with toast-based feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor with error detection, tracking, and retry logic for actor initialization failures.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines identity, actor state, and a backend probe to report connection status and provide retry handling.",
  "frontend/src/hooks/useCasesStore.ts": "Manages merged local and server surgery case data with create/update mutations backed by local persistence.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Returns Draft or Live based on hostname heuristics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, managing login, logout, identity loading, and status flags.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using navigator events.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles and surgery cases, including paginated case retrieval and error handling. Includes helpers for creating and updating cases with backend actor calls.",
  "frontend/src/hooks/useSync.ts": "Implements a sync routine that merges local and server surgery cases, handles pagination, normalizes data, and updates local storage and query cache. Includes utilities for normalizing case fields and handling sync errors.",
  "frontend/src/index.css": "Defines Tailwind CSS base layers and custom CSS variables for light and dark themes. Applies global background, text, and border styles.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge. Simplifies conditional Tailwind class composition.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers. Renders the main App component and imports global styles.",
  "frontend/src/types/cases.ts": "Defines TypeScript types for local surgery cases and form inputs, extending backend case types with local-only fields. Re-exports backend demographic and task checklist types.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into user-friendly categories and messages, distinguishing authorization, network, initialization, and trap errors. Provides helpers for actor initialization error handling.",
  "frontend/src/utils/csv.ts": "Converts surgery case data to CSV and parses CSV files into structured rows with validation, including task column handling and error detection. Includes a CSV line parser with quote handling.",
  "frontend/src/utils/dates.ts": "Implements timezone-safe date-only parsing, formatting, and conversion to/from nanoseconds. Provides helper functions for working with UI date pickers and legacy date formats.",
  "frontend/src/utils/demographicsExtract.ts": "Deterministically extracts patient demographic fields from pasted text using regex and fallbacks. Handles MRN, pet name, owner name, species, breed, sex, dates, and complaint.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and checks the Draft admin token from URL or sessionStorage. Provides helpers to detect missing tokens.",
  "frontend/src/utils/localPersistence.ts": "Loads, normalizes, saves, and clears locally stored surgery cases using localStorage with BigInt handling. Ensures saved cases have all expected fields.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases while preserving local-only fields. Prepares cases for sync by applying pending local changes.",
  "frontend/src/utils/prefill.ts": "Finds the most recent case matching an MRN and extracts prefill demographic data. Sorts by arrival date and caseId.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities to create, normalize, and derive required tasks in a checklist. Handles legacy formats and new-case initialization.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters across routing modes. Includes helpers for sessionStorage and cleaning URL hash entries.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, containers, animations, and plugins. Extends theme for app-specific styling.",
  "project_state.json": "Defines project metadata, known issues, and existing features related to improving surgery case loading and error handling. Indicates the project is a fix request with no new feature requests."
}