{
  "backend/main.mo": "Motoko backend actor handling authorization, user profiles, and CRUD operations for surgery cases with per-user storage and timestamped sync fields.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of various frontend files including hooks, utilities, components, and types.",
  "frontend/DEPLOYMENT_NOTES.md": "Deployment notes explaining when and how to redeploy the frontend with fresh backend bindings.",
  "frontend/index.css": "Tailwind CSS setup defining base theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/redeploy.sh": "Shell script performing deterministic clean rebuild and redeploy of the frontend.",
  "frontend/scripts/clean-rebuild-frontend.sh": "Script that fully cleans, reinstalls, regenerates bindings, and rebuilds the frontend.",
  "frontend/scripts/verify-live-backend-binding.md": "Guide for verifying that the deployed frontend uses fresh backend bindings and the correct canister ID.",
  "frontend/src/App.tsx": "Main React application component managing authentication, profile setup, case list, case form modal, search, and sorting.",
  "frontend/src/components/cases/CameraCapture.tsx": "Empty or placeholder file for a camera capture component.",
  "frontend/src/components/cases/CaseCard.tsx": "Displays a surgery case card with demographics, arrival data, complaint, and editable task checklist, syncing updates locally and to the server.",
  "frontend/src/components/cases/CaseForm.tsx": "Provides a form for creating or editing cases with prefill logic, demographics extraction, validation, and task checklist setup.",
  "frontend/src/components/cases/CaseList.tsx": "Lists cases with search, sort, and connection-aware empty states, rendering CaseCard entries and handling loading states.",
  "frontend/src/components/cases/DateField.tsx": "A date input with a calendar popover that validates and formats YYYY-MM-DD strings.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Textarea that extracts and returns demographics data from pasted text to auto-fill form fields.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Shows empty-state UI with optional migration guidance based on authentication and backend connectivity.",
  "frontend/src/components/cases/SortControls.tsx": "Controls for selecting sort field and toggling sort direction for case lists.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Renders and manages required task checkboxes, normalizing the checklist and emitting updates on toggle.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all cases to a CSV file and triggers a download with basic error handling and toasts.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "No summary available.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Error boundary for modal content that logs errors and displays a fallback alert with a close option.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying current year and a link to caffeine.ai with branding.",
  "frontend/src/components/layout/Header.tsx": "Header with app branding and login/logout handling using Internet Identity and query cache resets.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Startup error screen explaining connection issues with retry and reload actions.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Status bar showing online state, backend connection, sync actions, and related errors.",
  "frontend/src/hooks/useActor.ts": "Hook creating and caching an authenticated or anonymous backend actor and invalidating dependent queries on change.",
  "frontend/src/hooks/useActorWithError.ts": "Wrapper around useActor that tracks initialization failures and provides retry logic.",
  "frontend/src/hooks/useBackendConnection.ts": "Manages backend connectivity by combining identity, actor readiness, and a probe query, exposing overall connection status and retry handling.",
  "frontend/src/hooks/useCasesStore.ts": "Maintains merged local and server surgery cases with add, update, delete, and import mutations using React Query and local storage.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Returns 'Draft' or 'Live' environment label based on hostname heuristics.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities and exposing login, logout, and status tracking.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status via window events.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and surgery cases through the backend actor.",
  "frontend/src/hooks/useSync.ts": "Synchronizes local pending surgery cases with the backend and merges updated server state back into local storage.",
  "frontend/src/index.css": "Tailwind CSS base styles and theme variables for light and dark modes.",
  "frontend/src/lib/utils.ts": "Utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/types/cases.ts": "Defines LocalSurgeryCase with local-only fields and form data shape for case input, re-exporting backend task and demographics types.",
  "frontend/src/utils/backendErrorMessages.ts": "Classifies backend errors into categories and user-facing messages, with helpers for actor initialization errors.",
  "frontend/src/utils/csv.ts": "Converts LocalSurgeryCase objects to CSV and parses CSV files into rows with validation and task column handling.",
  "frontend/src/utils/dates.ts": "Provides timezone-safe date-only validation, formatting, and conversion utilities including nanosecond conversions.",
  "frontend/src/utils/demographicsExtract.ts": "Extracts patient demographics from raw text using regex and keyword matching to populate structured fields.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and checks the presence of a draft admin token from URL or session storage.",
  "frontend/src/utils/localPersistence.ts": "Loads, normalizes, saves, and clears LocalSurgeryCase data in localStorage with BigInt-safe serialization.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases preserving local-only fields and prepares cases for sync by applying local pending changes.",
  "frontend/src/utils/prefill.ts": "Provides utilities to find the most recent case by MRN and extract demographics for form prefilling.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and functions to create, normalize, and manage task checklists for cases.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project metadata, known issues, and feature definitions for the Surgery Case Tracker."
}