{
  "backend/main.mo": "Motoko backend defining user profiles and surgery case types with authorization checks and CRUD-like operations for profiles and case creation.",
  "feature_evidence.json": "JSON report mapping feature IDs to related frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend files describing their purpose and major behaviors.",
  "frontend/DEPLOYMENT_NOTES.md": "Instructions for redeploying the frontend with fresh backend bindings and troubleshooting connection issues.",
  "frontend/index.css": "Tailwind CSS setup defining design tokens, theme variables, and dark mode overrides.",
  "frontend/index.html": "Base HTML file mounting the React app and loading the main entry script.",
  "frontend/redeploy.sh": "Shell script performing deterministic frontend clean rebuild and deployment with backend ID reporting.",
  "frontend/scripts/clean-rebuild-frontend.sh": "Script that removes stale artifacts, reinstalls dependencies, regenerates backend bindings, and builds the frontend.",
  "frontend/scripts/verify-live-backend-binding.md": "Guide for verifying that the live frontend is using fresh backend bindings and the correct backend canister ID.",
  "frontend/src/App.tsx": "Main React application managing authentication, backend connection, profile setup, case list UI, modals, and sync controls.",
  "frontend/src/components/cases/CameraCapture.tsx": "Empty or placeholder file for camera-based image capture functionality.",
  "frontend/src/components/cases/CaseCard.tsx": "Renders a surgery case card with demographics, tasks, edit/delete actions, and syncs task and deletion updates to local and server stores.",
  "frontend/src/components/cases/CaseForm.tsx": "Provides a form for creating or editing surgery cases with prefill, demographics parsing, and task checklist management.",
  "frontend/src/components/cases/CaseList.tsx": "Displays filtered and sorted surgery cases, handling loading states, empty states, and edit triggers.",
  "frontend/src/components/cases/DateField.tsx": "A date input with calendar popover supporting manual entry, validation, and selection.",
  "frontend/src/components/cases/DemographicsQuickAdd.tsx": "Text area that extracts demographics from pasted text and passes structured data to the parent form.",
  "frontend/src/components/cases/EmptyCasesState.tsx": "Shows empty-state UI with optional draft-to-live migration guidance based on connection and authentication.",
  "frontend/src/components/cases/SortControls.tsx": "Controls for selecting sort field and toggling ascending or descending order.",
  "frontend/src/components/cases/TasksChecklist.tsx": "Displays and updates required case tasks, normalizing data and toggling task completion.",
  "frontend/src/components/csv/CsvExportButton.tsx": "Exports all locally stored cases to a CSV file and handles success or error notifications.",
  "frontend/src/components/csv/CsvImportDialog.tsx": "CSV import dialog that parses files, shows warnings/errors, and imports cases into the store.",
  "frontend/src/components/errors/BackendConnectionTroubleshooting.tsx": "Error banner providing troubleshooting steps and retry options for backend connection failures.",
  "frontend/src/components/errors/ModalErrorBoundary.tsx": "Error boundary for modal content that logs errors and displays a fallback UI with a close button.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying app info, current year, and a link to caffeine.ai with tracking parameters.",
  "frontend/src/components/layout/Header.tsx": "Header with branding, environment label, and login/logout handling via Internet Identity.",
  "frontend/src/components/startup/StartupRecoveryScreen.tsx": "Startup error screen showing connection issues with retry/reload actions and token-specific guidance.",
  "frontend/src/components/sync/SyncStatusBar.tsx": "Status bar showing online status, backend connection state, and sync controls with error feedback.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor, initializing access control and refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useActorWithError.ts": "Wraps useActor to track initialization errors and provide retry logic using React Query.",
  "frontend/src/hooks/useBackendConnection.ts": "Combines identity and actor state to determine backend connectivity, probing reachability and offering a full retry flow.",
  "frontend/src/hooks/useCasesStore.ts": "Manages merged local and server surgery cases with normalization plus add, update, delete, and import mutations.",
  "frontend/src/hooks/useEnvironmentLabel.ts": "Derives an environment label (Draft or Live) from the current hostname.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling identity load, login, logout, and status tracking via AuthClient.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks online/offline browser status using window events and returns a boolean.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles and surgery cases using the backend actor with auth-aware error handling.",
  "frontend/src/hooks/useSync.ts": "Synchronizes pending local surgery case changes with the backend, merging results and updating local storage and query cache.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and applies base styles.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and an Internet Identity provider.",
  "frontend/src/types/cases.ts": "Defines TypeScript types for surgery cases, form data, and re-exports backend-related types.",
  "frontend/src/utils/backendErrorMessages.ts": "Provides functions to classify backend errors into user-friendly categories and messages.",
  "frontend/src/utils/csv.ts": "Handles CSV generation and parsing for surgery cases, including validation and task column handling.",
  "frontend/src/utils/dates.ts": "Implements timezone-safe utilities for parsing, formatting, and converting date-only strings and nanosecond timestamps.",
  "frontend/src/utils/demographicsExtract.ts": "Extracts patient demographics from free text using regex patterns and heuristic parsing.",
  "frontend/src/utils/draftAdminToken.ts": "Retrieves and checks a draft admin token persisted in URL parameters or session storage.",
  "frontend/src/utils/localPersistence.ts": "Loads, normalizes, saves, and clears surgery cases in localStorage with BigInt-safe serialization.",
  "frontend/src/utils/mergeCases.ts": "Merges local and server surgery cases, preserving local-only fields and preparing pending changes for sync.",
  "frontend/src/utils/prefill.ts": "Finds the latest case by MRN and extracts demographic prefill data for new forms.",
  "frontend/src/utils/tasksChecklist.ts": "Defines task metadata and utilities to create, normalize, and derive required tasks from task checklists.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Stores project state, feature summaries, and pending feature requests for the Surgery Case Tracker."
}