{
  "kind": "build_request",
  "title": "Fix backend connectivity and add clear connection diagnostics",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Fix the frontend-to-backend connection so authenticated users can successfully create an actor and call backend methods (e.g., `getCallerUserProfile`, `getAllSurgeryCases`) without the app behaving as if it is disconnected.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "App not connected on backend"
        ]
      },
      "acceptanceCriteria": [
        "When logged in with Internet Identity, the app successfully loads the user profile (or prompts for profile setup) and fetches cases from the backend without requiring manual refreshes.",
        "If backend calls fail, the failure is surfaced as a clear error state (not silent fallback) indicating the app could not connect or is unauthorized.",
        "A successful backend connection is confirmed by at least one successful read call (e.g., `getCallerUserProfile` or `getAllSurgeryCases`) after login."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Harden actor initialization in `frontend/src/hooks/useActor.ts` so that failures during `createActorWithConfig(...)` and/or `_initializeAccessControlWithSecret(...)` do not leave the UI in an ambiguous state; instead, capture the error and expose it to the UI as a backend connection/initialization error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "App not connected on backend"
        ]
      },
      "acceptanceCriteria": [
        "If actor creation fails (network, canister ID/host misconfiguration, agent error), `useActor` exposes a non-null error string describing the failure in English.",
        "If `_initializeAccessControlWithSecret` fails (e.g., missing/invalid token), the error is captured and surfaced; the app does not silently proceed as if connected.",
        "`useActor` continues to return a stable `actor: null` state when initialization fails, and dependent queries/mutations do not throw uncaught errors that break rendering."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Add a visible, user-facing backend connection status and error message in the UI (English), including a simple retry action, so users can tell the difference between Offline mode and Backend not connected/unauthorized.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "App not connected on backend"
        ]
      },
      "acceptanceCriteria": [
        "When the actor is not available due to initialization failure, the UI shows a clear message such as \"Not connected to backend\" or a more specific error in English.",
        "The status UI distinguishes: (1) browser offline, vs (2) browser online but backend connection/authorization failed.",
        "A retry control is available that re-attempts actor initialization and/or refetches backend queries; on success, the error/status clears and backend data loads."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional canisters/services.",
    "Do not edit files under `frontend/src/hooks/useInternetIdentity.ts` / `.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or `frontend/src/components/ui` beyond composing/using them as allowed by immutable path rules (note: `frontend/src/hooks/useActor.ts` is listed as immutable in system context, so implement actor error propagation and connection diagnostics without modifying this file directly—e.g., by adding a new wrapper hook or higher-level connection manager).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Implementing real-time connectivity via WebSockets or push notifications.",
    "Changing case/task features unrelated to backend connectivity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}