{
  "kind": "build_request",
  "title": "Add case notes field and visual highlights on patient card and tasks",
  "projectName": "Surgery Case Tracker",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a \"Case Notes\" field to the New Case / Edit Case form and save it with the case data so that notes persist across reloads and sync.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a field to the New Case form that allows for notes about the case to be added."
        ]
      },
      "acceptanceCriteria": [
        "The CaseForm renders a textarea (or equivalent multi-line input) labeled \"Case Notes\".",
        "When creating a new case, the entered notes are stored in the local case object and included in pending sync data.",
        "When editing an existing case, the notes field is prefilled from the case and updates are persisted.",
        "The backend SurgeryCase type includes a notes field, and create/update/sync flows preserve the notes value.",
        "After syncing and reloading the app, notes remain present for the case."
      ]
    },
    {
      "id": "REQ-2",
      "text": "On the patient card (case card), display the case notes in a visually distinct colored boxed section so the notes stand out more than regular demographic rows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "In the patient card put a color box around this field so it stands otu more."
        ]
      },
      "acceptanceCriteria": [
        "CaseCard displays a \"Case Notes\" section when notes exist; if notes are empty/missing it displays an em dash (—) or hides the section (choose one behavior and apply consistently).",
        "The notes section uses a clearly visible colored background and border (a boxed callout style) distinct from the surrounding card content.",
        "The layout handles long notes with wrapping without breaking the card layout."
      ]
    },
    {
      "id": "REQ-3",
      "text": "On the patient card task list UI, add a purple outlined box around the Histo task row and a blue outlined box around the Imaging task row.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "On the patient card put a Purple box around the Histo task; Blue box around the Imaging task"
        ]
      },
      "acceptanceCriteria": [
        "In the TasksChecklist rendering used by CaseCard, the Histo task row is visually wrapped/outlined with a purple border/box.",
        "In the TasksChecklist rendering used by CaseCard, the Imaging task row is visually wrapped/outlined with a blue border/box.",
        "The highlight styling applies regardless of whether the tasks are checked, and does not block checkbox interaction."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the updated application builds successfully and can be redeployed after the changes (retry the previously failing build/deploy process).",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Try running it again with the updates"
        ]
      },
      "acceptanceCriteria": [
        "A clean build succeeds without TypeScript or Motoko compile errors.",
        "Frontend bindings are regenerated as needed so the frontend type definitions match the updated backend types.",
        "Deployment produces a working app where the new notes field and task highlights are visible."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "If the backend state schema changes (adding notes to SurgeryCase), include a conditional backend migration (backend/migration.mo) to safely upgrade existing stored cases by setting notes to an empty string for existing records.",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use English for all user-facing labels and text."
  ],
  "nonGoals": [
    "Implement camera capture or image upload features.",
    "Add third-party authentication providers (only Internet Identity is supported).",
    "Add real-time updates (no WebSockets/chat)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}