{
  "kind": "build_request",
  "title": "Fix live backend connection initialization failure",
  "projectName": "Surgery Case Tracker",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the frontend-only backend initialization call to the non-existent actor method `_initializeAccessControlWithSecret` so the backend actor can be created successfully in the live app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "failed to initialize backend connection in live app"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/hooks/useActor.ts` no longer calls `actor._initializeAccessControlWithSecret(...)` during actor creation.",
        "The app can create an authenticated actor without throwing a runtime or TypeScript interface error in Live/production.",
        "Backend connection status can reach “Backend Connected” for an authenticated user when the canister is available."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Eliminate reliance on the `caffeineAdminToken` URL parameter for normal actor initialization and ensure backend connection error messaging does not instruct users to provide a Draft admin token unless the app explicitly still supports a Draft-token-based flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "failed to initialize backend connection in live app"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/hooks/useActor.ts` does not read `caffeineAdminToken` as part of actor initialization.",
        "`frontend/src/utils/backendErrorMessages.ts` does not surface “Draft admin token is required…” for standard Live connection failures.",
        "When the backend is unreachable or the user is unauthorized, the UI displays an accurate English error message via existing connection UI (e.g., SyncStatusBar) without mentioning admin tokens."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure the backend connection probing flow (actor creation + `getCallerUserProfile` probe) reports actionable errors and provides a working retry path in the live app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "failed to initialize backend connection in live app"
        ]
      },
      "acceptanceCriteria": [
        "If actor creation fails or the probe call fails, `useBackendConnection` surfaces a non-empty English error string and `SyncStatusBar` shows “Backend Connection Error: …”.",
        "Clicking “Retry Connection” triggers the existing retry mechanism and re-runs both actor initialization and the probe call.",
        "Successful retry clears the error and updates status to “Backend Connected” without requiring a page reload."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (read-only components).",
    "Do not edit immutable paths listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`) beyond what is necessary to fix the reported initialization failure; prefer adding new wrapper logic/files when feasible."
  ],
  "nonGoals": [
    "Do not add new authentication providers (Internet Identity remains the only supported auth).",
    "Do not introduce external databases or third-party backend services.",
    "Do not change backend authorization semantics or roles unless required to resolve the connection initialization error."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}