{
  "kind": "build_request",
  "title": "Clean rebuild and restore Live backend connectivity",
  "projectName": "Surgery Case Tracker",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Perform a fresh clean rebuild and redeploy of both backend and frontend canisters so the Live frontend is guaranteed to reference the currently deployed backend canister ID (eliminate any stale canister-ID/binding artifacts).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "trigger a fresh clean rebuild"
        ]
      },
      "acceptanceCriteria": [
        "A clean build is executed using steps equivalent to removing prior build artifacts (e.g., frontend/dist, frontend/node_modules, and .dfx) and then redeploying backend and frontend.",
        "After redeploy, opening the Live app no longer shows: \"Backend Connection Error: Failed to initialize backend connection. The backend service may be unavailable.\"",
        "The frontend build uses freshly generated backend bindings (dfx generate backend) from the currently deployed backend canister."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make backend actor initialization compatible with the existing Live frontend by adding a public backend method named `_initializeAccessControlWithSecret` that safely no-ops (does not change access control or require any token) and returns successfully.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I n the live version Backend Connection Error:\nFailed to initialize backend connection. The backend service may be unavailable."
        ]
      },
      "acceptanceCriteria": [
        "The Motoko backend exposes a callable method `_initializeAccessControlWithSecret(secret : Text) : async ()` (or equivalent signature compatible with generated frontend bindings).",
        "Calling `_initializeAccessControlWithSecret` does not grant permissions, does not modify roles, and does not affect authorization behavior of existing endpoints.",
        "Frontend TypeScript bindings generated from the backend include `_initializeAccessControlWithSecret`, allowing the frontend to compile without type errors related to that method."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useActor.ts or other paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep all Motoko logic within the single actor in backend/main.mo; only add migration code if a state upgrade is required (avoid migration if not needed).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Redesigning the UI/UX beyond what is necessary to verify backend connectivity.",
    "Adding new authentication methods beyond Internet Identity.",
    "Introducing external databases or third-party backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}