{
  "kind": "build_request",
  "title": "Stricter backend fix to prevent surgery-case loading traps",
  "projectName": "Surgery Case Tracker",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Motoko backend so loading surgery cases cannot trap due to large datasets (e.g., \"heap out of bounds\"), by refactoring the per-user surgery-case storage and all read paths to avoid materializing an unbounded list in memory.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "On live app web page Server Cases Loading Failed",
          "yes, apply stricter fix"
        ]
      },
      "acceptanceCriteria": [
        "Calling `getSurgeryCases(start, limit)` never traps due to dataset size and always enforces a hard maximum page size of 100 returned cases (or smaller if fewer remain).",
        "`getSurgeryCases(start, limit)` does not convert the entire per-user case collection to an array as part of pagination (no full-list `toArray()`/equivalent on the complete dataset).",
        "Calling the legacy `getAllSurgeryCases()` never traps due to dataset size; it must be implemented in a way that has a strict, documented upper bound on returned items and does not attempt to serialize an unbounded dataset in a single response.",
        "The live frontend can load server cases successfully (no \"Server Cases Loading Failed\" caused by backend trapping) even when the user has a large number of cases."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make `syncLocalChanges(localCases)` safe for large numbers of cases by ensuring it does not perform quadratic scans over the full dataset and does not require building full intermediate arrays/lists that scale with total case count beyond a bounded, linear pass.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "The backend encountered an error processing your request.",
          "yes, apply stricter fix"
        ]
      },
      "acceptanceCriteria": [
        "`syncLocalChanges` completes without trapping for large `localCases` inputs and large existing server datasets (no heap/memory traps caused by merge logic).",
        "The merge logic uses a bounded-memory, linear-time approach (e.g., indexing by `caseId`) rather than nested loops over both collections.",
        "After a sync, subsequent `getSurgeryCases` calls succeed and return the merged dataset without trapping."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`.",
    "Do not edit frontend files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui`."
  ],
  "nonGoals": [
    "Adding new user-facing features unrelated to fixing the backend trap and restoring stable case loading.",
    "Introducing additional backend services, external databases, or non-Motoko backend components."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}