{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Draft startup recovery: actionable actor initialization errors, admin-token persistence, and reliable retry",
  "requirements": [
    {
      "id": "REQ-45",
      "summary": "Surface backend actor initialization failures in the UI and expose an explicit actor error state for downstream hooks.",
      "acceptanceCriteria": [
        "When backend actor creation or `_initializeAccessControlWithSecret(...)` fails, the error is captured and surfaced as a specific, user-visible message (English) on the StartupRecoveryScreen instead of only setting `actor` to null.",
        "`useActor` returns an explicit error state (e.g., `error: string | null`) in addition to `actor` and `isFetching` so downstream hooks can distinguish 'still loading' vs 'failed to create actor'.",
        "`useBackendConnection` uses the actor initialization error (when present) as the primary displayed error, rather than overwriting it with the generic \"Failed to initialize backend connection\" message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Capture and retain actor creation / access-control initialization failures as a typed, user-safe error string (do not leak secrets), and return it from `useActor` alongside `actor` and `isFetching` so callers can distinguish loading vs initialization failure. This includes failures related to the authorization component's access-control initialization; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useBackendConnection.ts",
          "operation": "modify",
          "description": "Prefer the actor initialization error from `useActor` as the primary `error` value, and avoid replacing it with a generic message when `actor` is null; only run the backend probe when actor initialization succeeded and the actor is available."
        },
        {
          "path": "frontend/src/components/startup/StartupRecoveryScreen.tsx",
          "operation": "modify",
          "description": "Ensure the recovery UI presents the passed-in initialization error as the key actionable message in English (no silent fallback to generic text), while keeping supporting guidance secondary."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Detect missing/empty Draft admin token during access-control initialization, guide the user, and persist/reuse the token across logout/login within the same session.",
      "acceptanceCriteria": [
        "If `caffeineAdminToken` is missing/empty at the moment `_initializeAccessControlWithSecret(...)` is attempted, the UI displays an English error explaining that the Draft build requires an admin token and instructs the user to open the Draft URL that contains the token (do not display the token value).",
        "The token retrieval logic uses the existing URL/session helpers in `frontend/src/utils/urlParams.ts` so that, once provided, the token is stored in `sessionStorage` and continues to work after the user logs out and logs back in (until the browser session ends).",
        "Retrying from the recovery screen re-attempts actor initialization using the persisted token without requiring the user to re-enter it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/draftAdminToken.ts",
          "operation": "create",
          "description": "Add a small helper that retrieves `caffeineAdminToken` using the existing URL/session utilities from `frontend/src/utils/urlParams.ts` (sessionStorage persistence), and provides safe checks for missing/empty tokens without ever returning a value intended for display."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Use the Draft admin-token helper (backed by `urlParams.ts` session persistence) when attempting `_initializeAccessControlWithSecret(...)`; if the token is missing/empty at that moment, fail actor initialization with an explicit English message instructing the user to open the Draft URL containing the token (do not display the token). This interacts with the authorization component's access-control init; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/startup/StartupRecoveryScreen.tsx",
          "operation": "modify",
          "description": "Ensure the token-missing guidance message is clearly readable in English and does not include or echo the token value."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Differentiate unauthorized vs unreachable backend failures during Draft startup and show accurate English messages without misclassifying initialization failures.",
      "acceptanceCriteria": [
        "If the backend call fails due to authorization (e.g., traps containing \"Unauthorized\"), the recovery screen shows an authorization-specific message (English) rather than a generic connectivity message.",
        "If the failure is due to network/canister unavailability, the recovery screen shows a network/service-unavailable specific message (English).",
        "The displayed error path does not misclassify 'actor not available because it failed to initialize' as a network failure; it should be reported as initialization failure with the underlying cause included when available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/backendErrorMessages.ts",
          "operation": "create",
          "description": "Create a shared error-classification utility that converts raw thrown errors (including trap messages) into user-facing English messages, distinguishing authorization failures vs service/network unavailability, and preserving initialization failure causes when available."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Map actor creation and `_initializeAccessControlWithSecret(...)` failures to clear, user-facing English messages via the shared error-message utility, ensuring initialization failures remain categorized as initialization failures (not network failures). This is closely related to the authorization component behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useBackendConnection.ts",
          "operation": "modify",
          "description": "Use the shared error-message utility to classify backend probe failures into authorization vs service/network-unavailable messages, while ensuring actor initialization failures short-circuit and are surfaced as initialization failures (not probe/network errors)."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Make Retry Connection fully reset failed startup state and perform a fresh actor init + fresh probe without a page reload.",
      "acceptanceCriteria": [
        "Clicking \"Retry Connection\" clears prior actor/probe errors and triggers a fresh actor initialization attempt, followed by a fresh backend probe, without requiring `window.location.reload()`.",
        "If a retry succeeds, the app transitions into the authenticated main UI and does not continue to show the StartupRecoveryScreen.",
        "If a retry fails, the user sees the latest failure reason (English), not a stale error from a previous attempt."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Expose a retry/reset mechanism from `useActor` (e.g., a `retry` function that clears the prior init error and forces a new initialization attempt) so higher-level hooks can reliably restart actor initialization without a full page reload."
        },
        {
          "path": "frontend/src/hooks/useBackendConnection.ts",
          "operation": "modify",
          "description": "Update `retry` to fully reset startup state by clearing stored connection/probe errors and triggering (1) a fresh actor initialization attempt via `useActor`’s reset/retry mechanism, then (2) a fresh backend probe. Ensure the latest failure is shown and that success clears errors so the app can transition out of StartupRecoveryScreen."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the recovery screen Retry Connection action to the updated retry behavior (no page reload needed) and ensure successful retries allow the authenticated main UI to render instead of continuing to show StartupRecoveryScreen."
        },
        {
          "path": "frontend/src/components/sync/SyncStatusBar.tsx",
          "operation": "modify",
          "description": "Ensure the status-bar Retry Connection action benefits from the same full reset behavior (fresh actor initialization + fresh probe) and displays the latest error state consistently."
        }
      ]
    }
  ]
}