{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend sync pagination + friendly trap error messaging",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update sync to use bounded/paginated case retrieval instead of unbounded getAllSurgeryCases so sync works with many cases.",
      "acceptanceCriteria": [
        "The Sync action in the live app completes successfully without triggering a canister trap when the user has many cases.",
        "frontend/src/hooks/useSync.ts no longer makes assumptions that the entire case list can be fetched in a single call.",
        "Sync still correctly merges server and local cases and clears pendingSync on success."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSync.ts",
          "operation": "modify",
          "description": "Replace sync’s reliance on actor.getAllSurgeryCases() with a bounded retrieval strategy using the existing paginated backend capability actor.getSurgeryCases(start, limit). Implement a loop to fetch server cases in pages (with a conservative page size), accumulating results until exhaustion, and use that bounded retrieval both before sync (for prepareCasesForSync) and after sync (for mergeCases + pendingSync clearing). Ensure sync continues to update local persistence and React Query caches as it does today."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve sync error handling so replica rejection/trap errors show a clear English message while logging raw details to the console.",
      "acceptanceCriteria": [
        "If the backend returns a replica rejection/trap during sync, the UI displays an English, user-friendly error (e.g., indicating the backend failed and to retry), and does not display the full raw request/rejection dump.",
        "The raw error details remain available in developer console logs for debugging.",
        "All user-facing error text added/modified for this fix is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/backendErrorMessages.ts",
          "operation": "modify",
          "description": "Enhance error classification to explicitly recognize replica rejection/trap-style errors (e.g., messages containing “replica”, “reject”, “trapped”, “heap out of bounds”) and map them to a concise, user-friendly English message suitable for showing in the Sync UI, while keeping the raw details available for console logging by callers."
        },
        {
          "path": "frontend/src/hooks/useSync.ts",
          "operation": "modify",
          "description": "Update sync error handling to never surface raw backend/replica dumps to users. Keep console.error logging the raw error object/details, but set syncError using the classified user-friendly message from classifyBackendError (instead of falling back to error.message). Ensure Unauthorized remains clearly communicated in English without exposing low-level rejection payloads."
        },
        {
          "path": "frontend/src/components/sync/SyncStatusBar.tsx",
          "operation": "modify",
          "description": "Update Sync failure toast behavior to prefer displaying the friendly syncError message (when available) rather than a generic failure string, ensuring the user sees clear English guidance while the detailed raw error remains only in the developer console."
        }
      ]
    }
  ]
}