{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Quick Add Demographics paste extraction and feedback",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix Quick Add Demographics paste handler so extraction runs reliably and populates CaseForm fields from pasted text without depending on async clipboardData access.",
      "acceptanceCriteria": [
        "When the user pastes text into the \"Quick Add Demographics\" textarea, extraction runs and the form auto-fills any eligible fields (MRN, Pet Name, Owner Last Name, Species, Breed, Sex, Date of Birth) based on the pasted text.",
        "Extraction must not depend on reading clipboardData asynchronously after the paste event (i.e., it must still work even if the paste event object is no longer valid).",
        "The pasted text must remain visible in the Quick Add Demographics textarea after paste, and the user can still edit it normally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cases/DemographicsQuickAdd.tsx",
          "operation": "modify",
          "description": "Refactor the textarea onPaste handler to synchronously capture pasted plain text during the paste event (store it in a local variable) and trigger demographics extraction using that stored string (not the event object). Keep default paste behavior so the controlled textarea retains the pasted text and remains editable."
        },
        {
          "path": "frontend/src/components/cases/CaseForm.tsx",
          "operation": "modify",
          "description": "Ensure the Quick Add Demographics onPaste callback continues to apply extracted fields to CaseForm state while respecting existing touchedFields and existing field values, so paste reliably results in auto-fill when eligible."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve demographics extraction rules to support more real-world pasted formats for names and MRN identifiers while preserving touchedFields behavior.",
      "acceptanceCriteria": [
        "Extraction correctly handles pet/patient names that include mixed case and common characters (e.g., hyphen/apostrophe) instead of only matching a single lowercase token.",
        "Extraction correctly handles MRN/record identifiers that may include prefixes and separators (e.g., \"MRN: A-12345\").",
        "Extraction does not overwrite fields in the CaseForm that the user has already touched, consistent with the existing touchedFields behavior in CaseForm."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/demographicsExtract.ts",
          "operation": "modify",
          "description": "Expand deterministic regex/keyword parsing to better match common pasted demographics formats: allow mixed-case, multi-token names and common punctuation (hyphen/apostrophe) for patient names; broaden MRN patterns to reliably capture prefixed identifiers with separators (e.g., \"MRN:\", \"Record #\", letter-prefix + hyphen). Keep extraction on-device and deterministic per non-goals."
        },
        {
          "path": "frontend/src/components/cases/CaseForm.tsx",
          "operation": "modify",
          "description": "Confirm the auto-fill mapping from extracted demographics to CaseForm fields continues to avoid overwriting user-touched fields (touchedFields) and avoids overwriting non-empty text inputs, consistent with current behavior."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add non-blocking user feedback when pasted demographics text yields no usable extracted fields, and preserve success feedback when fields are filled.",
      "acceptanceCriteria": [
        "If the user pastes text and extraction yields no fields, show a non-blocking message (e.g., toast) indicating that no demographics were detected.",
        "If at least one field is auto-filled, the existing success feedback remains (or equivalent) and indicates how many fields were filled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cases/CaseForm.tsx",
          "operation": "modify",
          "description": "Update paste-extraction handling to show a non-blocking toast when extraction returns no usable fields, and keep/confirm the existing success toast messaging when one or more fields were auto-filled (including the filled field count)."
        }
      ]
    }
  ]
}