{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend backend-connection diagnostics, retry, and non-ambiguous actor initialization states",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Ensure authenticated sessions reliably establish a backend actor and confirm connectivity via at least one successful read call, with clear surfaced failures instead of silent fallback.",
      "acceptanceCriteria": [
        "When logged in with Internet Identity, the app successfully loads the user profile (or prompts for profile setup) and fetches cases from the backend without requiring manual refreshes.",
        "If backend calls fail, the failure is surfaced as a clear error state (not silent fallback) indicating the app could not connect or is unauthorized.",
        "A successful backend connection is confirmed by at least one successful read call (e.g., `getCallerUserProfile` or `getAllSurgeryCases`) after login."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendConnection.ts",
          "operation": "create",
          "description": "Create a higher-level backend connection manager hook that composes the existing Internet Identity + actor lifecycle to: (1) probe backend connectivity with a post-login read call (e.g., getCallerUserProfile/getCallerUserRole), (2) derive a single connection status and human-readable English error message, and (3) expose a retry function that re-attempts actor initialization and refreshes dependent queries. Use the selected \"authorization\" component concepts for post-login profile probing and for treating authorization traps as user-facing unauthorized/connection errors. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useCasesStore.ts",
          "operation": "modify",
          "description": "Stop silently treating backend failures as a normal disconnected state for authenticated users: capture fetch failures (when an actor exists but backend read calls fail) into an exposed error string/state that the UI can display, while still allowing offline/local cases when the browser is actually offline. Ensure no uncaught errors break rendering; errors should be stored and surfaced in English."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Align profile/case queries with connection diagnostics: avoid silent fallbacks when actor is unavailable due to initialization failure by throwing a clear Error (English) for authenticated flows where appropriate, and disable automatic retries that would mask the underlying actor/connectivity problem. Use the selected \"authorization\" component guidance for profile setup flow (getCallerUserProfile/saveCallerUserProfile) and for handling authorization failures gracefully in the UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new backend connection manager so that after login the app performs (and can react to) a confirmed successful read call before assuming it is connected. Ensure profile setup prompting continues to work without manual refresh (no modal flash), and that connection/authorization failures are surfaced via the shared status UI rather than appearing as 'disconnected' without explanation."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Harden actor initialization handling without modifying the immutable useActor.ts by capturing actor creation/initialization failures and exposing them as a stable UI-facing backend initialization error.",
      "acceptanceCriteria": [
        "If actor creation fails (network, canister ID/host misconfiguration, agent error), `useActor` exposes a non-null error string describing the failure in English.",
        "If `_initializeAccessControlWithSecret` fails (e.g., missing/invalid token), the error is captured and surfaced; the app does not silently proceed as if connected.",
        "`useActor` continues to return a stable `actor: null` state when initialization fails, and dependent queries/mutations do not throw uncaught errors that break rendering."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendConnection.ts",
          "operation": "create",
          "description": "Implement actor-initialization error capture without editing the immutable frontend/src/hooks/useActor.ts by inspecting the react-query state for the actor query (keyed by the current principal) and translating failures from createActorWithConfig(...) and/or _initializeAccessControlWithSecret(...) into a stable, non-null English error string. Expose derived fields like isInitializing/hasError and a safe retry() that invalidates/refetches the actor query."
        },
        {
          "path": "frontend/src/components/sync/SyncStatusBar.tsx",
          "operation": "modify",
          "description": "Integrate the new backend connection hook so actor initialization failures are shown as explicit, user-facing backend connection/initialization errors (English), rather than leaving the UI ambiguous. Ensure the UI remains stable when actor is null and no uncaught errors occur."
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Add a visible backend connection status banner that distinguishes offline vs backend unauthorized/connection failure and provides a retry action.",
      "acceptanceCriteria": [
        "When the actor is not available due to initialization failure, the UI shows a clear message such as \"Not connected to backend\" or a more specific error in English.",
        "The status UI distinguishes: (1) browser offline, vs (2) browser online but backend connection/authorization failed.",
        "A retry control is available that re-attempts actor initialization and/or refetches backend queries; on success, the error/status clears and backend data loads."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sync/SyncStatusBar.tsx",
          "operation": "modify",
          "description": "Extend the existing status bar to display (a) browser online/offline (existing), and (b) backend connection status from the new backend connection hook, including a clear English error message when browser is online but backend is not connected/unauthorized. Add a retry control that calls the hook's retry() and triggers query refetch to recover. Keep the UX consistent with existing shadcn/ui Alert/Button patterns; verify any existing component usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useOnlineStatus.ts",
          "operation": "modify",
          "description": "Optionally enhance online/offline status handling to support clearer UI messaging (e.g., initial null/unknown state or more robust event handling) if needed to reliably distinguish true offline mode from backend authorization/connection failures shown in the status UI."
        }
      ]
    }
  ]
}