{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Per-case required task selection, expanded checklist rendering, and CSV round-trip",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Ensure the frontend can represent, default, and round-trip the expanded 7-task checklist with required+completed per case.",
      "acceptanceCriteria": [
        "Frontend can construct and submit a TasksChecklist containing all 7 tasks, each with required and checked fields.",
        "New-case defaults in the UI set required=true for Discharge Notes and pDVM Notified; required=false for the other tasks; checked=false for all tasks.",
        "Frontend gracefully normalizes any older locally-stored cases that may be missing new task fields to avoid crashes and enable editing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/tasksChecklist.ts",
          "operation": "create",
          "description": "Add shared task definitions (keys + English labels) and helpers to (1) build default TasksChecklist for new cases and (2) normalize/upgrade partial or legacy checklist objects to the full 7-task shape (required+checked for every task)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the create-surgery-case mutation to accept and pass a full TasksChecklist argument (including required+checked for all 7 tasks) so created cases round-trip correctly with the expanded task model."
        },
        {
          "path": "frontend/src/hooks/useCasesStore.ts",
          "operation": "modify",
          "description": "Normalize loaded cases (from both local persistence and server fetch) so tasksChecklist is always in the expanded 7-task required+checked shape before saving to localStorage and rendering in the UI."
        },
        {
          "path": "frontend/src/types/cases.ts",
          "operation": "modify",
          "description": "Extend CaseFormData (or add companion form state types) to include required-task selections for the expanded 7-task checklist while keeping existing case typing compatible with backend TasksChecklist."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Add required-task selection (checkboxes) to the Case Form for create/edit with correct defaults and persisted values.",
      "acceptanceCriteria": [
        "The case form shows checkboxes for exactly these labels: Discharge Notes, pDVM Notified, Labs, Histo, Surgery Report, Imaging, Culture.",
        "When starting a new case, Discharge Notes and pDVM Notified are checked by default; the other five are unchecked by default.",
        "Saving a case persists the selected required tasks to the case record.",
        "Editing an existing case loads and displays the saved required-task selections."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cases/CaseForm.tsx",
          "operation": "modify",
          "description": "Add a 'Required Tasks' section to the form with checkboxes for the 7 task labels; initialize defaults for new cases (Discharge Notes + pDVM Notified required=true, others false) and load existing selections when editing; include tasksChecklist in create and update saves."
        },
        {
          "path": "frontend/src/utils/tasksChecklist.ts",
          "operation": "modify",
          "description": "Expose a single source of truth for task ordering and labels so CaseForm can render exactly the required checkboxes and apply the correct default required/checked states."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Render per-case to-do list on each Case Card using only required tasks and allow toggling completion with persistence.",
      "acceptanceCriteria": [
        "On each case card, only tasks marked required=true for that case are rendered in the to-do list.",
        "Each rendered required task has a completion toggle (checkbox) on the case card.",
        "Toggling a task updates the case’s saved completion state and remains correct after refreshing/reopening the app and after syncing with the backend.",
        "The task labels match exactly: Discharge Notes, pDVM Notified, Labs, Histo, Surgery Report, Imaging, Culture."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/cases/TasksChecklist.tsx",
          "operation": "modify",
          "description": "Expand the checklist UI to the 7 tasks; render only tasks where required=true; update toggle logic to flip only the checked field while preserving each task’s required flag; ensure English labels exactly match the requirement."
        },
        {
          "path": "frontend/src/components/cases/CaseCard.tsx",
          "operation": "modify",
          "description": "Ensure task updates sent from the card use the full expanded TasksChecklist object (including unchanged required flags) so completion toggles persist locally and round-trip through existing update flows."
        },
        {
          "path": "frontend/src/utils/tasksChecklist.ts",
          "operation": "modify",
          "description": "Provide a helper for iterating required tasks in a consistent order (shared by CaseCard/TasksChecklist) and for ensuring missing task fields are filled before rendering/toggling."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Update CSV import/export to include all 7 task options with backward compatibility and English import warnings.",
      "acceptanceCriteria": [
        "CSV export includes columns for all 7 task options.",
        "CSV import preview can ingest CSVs containing only the legacy two columns (Discharge Notes, pDVM Notified) without failing.",
        "CSV import preview can ingest CSVs containing any/all of the 7 task columns without failing.",
        "If the CSV contains unrecognized task columns, the import preview shows an English warning listing the ignored columns."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/csv.ts",
          "operation": "modify",
          "description": "Expand CSV headers to include all 7 task columns; export task values so required/checked can be represented (e.g., blank when not required, Yes/No when required); update parsing to (1) accept legacy two-task CSVs, (2) accept any subset of the 7 task columns, and (3) emit English warnings for truly unrecognized task-related columns that will be ignored."
        },
        {
          "path": "frontend/src/components/csv/CsvImportDialog.tsx",
          "operation": "modify",
          "description": "Update the import dialog English description text to list the supported task columns as all 7 task labels, and keep displaying parse warnings/errors from the CSV utilities."
        },
        {
          "path": "frontend/src/utils/tasksChecklist.ts",
          "operation": "modify",
          "description": "Add/extend helpers used by CSV conversion to map between task column labels and checklist keys consistently, ensuring the 7-task set remains the only supported options."
        }
      ]
    }
  ]
}