{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Surgery Case Tracker — Deterministic clean rebuild, redeploy, and live backend binding verification",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Harden the deterministic clean rebuild flow to reliably remove stale artifacts, regenerate backend TypeScript bindings from the currently deployed backend canister, and validate the legacy method is not referenced.",
      "acceptanceCriteria": [
        "Running `bash frontend/scripts/clean-rebuild-frontend.sh` completes successfully without errors.",
        "`frontend/src/declarations/backend/backend.did.d.ts` exists after the rebuild.",
        "The generated bindings file does not contain the legacy method `getAllSurgeryCases`.",
        "No frontend source files (excluding `frontend/src/declarations` and `node_modules`) reference `getAllSurgeryCases`.",
        "`frontend/dist` is rebuilt as part of the script run."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/clean-rebuild-frontend.sh",
          "operation": "modify",
          "description": "Make the clean rebuild more deterministic and self-validating: strengthen shell safety (e.g., strict error handling), ensure dependency install is lockfile-respecting, keep the existing binding regeneration from the deployed backend canister, and add explicit post-build checks that `frontend/dist` exists and bindings validation checks run as the script already intends."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Ensure the deterministic redeploy flow reliably redeploys the rebuilt frontend and prints the needed canister IDs and Live URL to confirm the correct deployment.",
      "acceptanceCriteria": [
        "Running `bash frontend/redeploy.sh` completes successfully without errors.",
        "The redeploy output prints both backend and frontend canister IDs and a Live URL when on mainnet.",
        "The deployed Live frontend no longer shows a backend disconnected error on page load."
      ],
      "file_operations": [
        {
          "path": "frontend/redeploy.sh",
          "operation": "modify",
          "description": "Tighten the deterministic redeploy flow: preserve the existing sequence (clean rebuild then deploy), improve robustness of network detection/output so it consistently prints backend + frontend canister IDs and the correct Live URL on mainnet, and add a final reminder to do a hard refresh to avoid cached assets after deploy."
        },
        {
          "path": "frontend/DEPLOYMENT_NOTES.md",
          "operation": "modify",
          "description": "Align redeploy documentation with the deterministic flow in `frontend/redeploy.sh`, including the expected console output (backend/front-end IDs + Live URL) and troubleshooting notes specific to cached assets and stale bindings after deployment."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update the Live verification guide to explicitly confirm the Live frontend is using fresh bindings and the expected backend canister ID after redeploy.",
      "acceptanceCriteria": [
        "The backend canister ID reported by `dfx canister id backend` matches the backend canister ID the Live frontend is effectively using (per the verification guide).",
        "A hard refresh of the Live site loads successfully and backend-dependent UI (e.g., initial connection check) indicates connected/online rather than disconnected."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/verify-live-backend-binding.md",
          "operation": "modify",
          "description": "Complete and clarify the post-redeploy verification steps to confirm (1) local regenerated bindings are fresh, (2) the expected backend canister ID is the one the built/deployed frontend is configured to use, and (3) a hard refresh of the Live site shows connected/online behavior rather than backend disconnected; keep the guide aligned with the outputs produced by `frontend/redeploy.sh`."
        }
      ]
    }
  ]
}