{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Quick Add Pet Name auto-fill reliability",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Quick Add demographics paste reliably extracts and auto-fills Pet Name when empty/untouched, without overwriting user-entered values or regressing other field extraction.",
      "acceptanceCriteria": [
        "Given the CaseForm is open for creating a new case and the Pet Name field is empty and untouched, pasting demographics text into the Quick Add textarea auto-fills the Pet Name field when the pasted text includes a pet/patient name.",
        "If the Pet Name field has already been typed into (touched) or is non-empty, a Quick Add paste does not overwrite the Pet Name field.",
        "A Quick Add paste that includes other demographics continues to behave as before (no regressions to MRN/owner/species/breed/sex/DOB/arrival date/presenting complaint extraction and auto-fill behavior).",
        "User-facing messages/toasts related to Quick Add remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/demographicsExtract.ts",
          "operation": "modify",
          "description": "Investigate and correct pet-name extraction edge cases in extractDemographics (e.g., names presented without labels, all-caps names, comma/pipe-delimited formats, trailing punctuation, and avoiding false positives). Keep existing MRN/owner/species/breed/sex/DOB/arrival/complaint extraction behavior intact and deterministic."
        },
        {
          "path": "frontend/src/components/cases/CaseForm.tsx",
          "operation": "modify",
          "description": "Fix how extracted petName is applied in CaseForm.handlePasteExtraction so it reliably fills only when the Pet Name field is currently empty (treat whitespace-only as empty) and has not been touched, and never overwrites user-entered values. Ensure other extracted fields continue to follow the same empty/untouched rules and existing English toasts remain unchanged."
        }
      ]
    }
  ]
}