{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Surgery Case Tracker — Clean frontend rebuild process to restore Live backend connectivity",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the Live frontend is rebuilt from a clean state and uses freshly generated backend bindings from the currently deployed backend canister (eliminate stale canister-id/binding artifacts).",
      "acceptanceCriteria": [
        "A clean build is executed using steps equivalent to removing prior build artifacts (e.g., frontend/dist, frontend/node_modules, and .dfx) and then redeploying backend and frontend.",
        "After redeploy, opening the Live app no longer shows: \"Backend Connection Error: Failed to initialize backend connection. The backend service may be unavailable.\"",
        "The frontend build uses freshly generated backend bindings (dfx generate backend) from the currently deployed backend canister."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT_NOTES.md",
          "operation": "modify",
          "description": "Update the clean rebuild + redeploy instructions to explicitly cover: (1) removing stale frontend build artifacts, (2) removing any stale generated frontend backend bindings, (3) re-running the backend binding generation step before building the frontend, and (4) a post-deploy verification checklist focused on confirming the Live frontend is using the currently deployed backend canister ID (no stale canister-id/binding artifacts)."
        },
        {
          "path": "frontend/scripts/clean-rebuild-frontend.sh",
          "operation": "create",
          "description": "Add a repo-local helper script that performs a deterministic frontend clean (e.g., remove frontend build output and local dependency artifacts) and then runs the frontend install/build commands in the correct order so developers/operators can reliably reproduce a clean rebuild process before deploying. (This script should be referenced by the updated frontend/DEPLOYMENT_NOTES.md.)"
        },
        {
          "path": "frontend/scripts/verify-live-backend-binding.md",
          "operation": "create",
          "description": "Add a short verification guide that operators can follow after redeploy to confirm the Live frontend is using fresh backend bindings and the currently deployed backend canister ID (e.g., checks for regenerated declaration artifacts, clean build confirmation, and observed absence of the backend initialization error in the Live UI)."
        }
      ]
    }
  ]
}